----------------------------------------------------------------
      name:  Ziqi
       log:  W:\Ziqi\Study\BUPT\3rd Year\NCM\CS Test\Data\CS_test.log
  log type:  text
 opened on:  11 Jun 2019, 18:21:07

. svyset univcode [pweight = sw_f]

      pweight: sw_f
          VCE: linearized
  Single unit: missing
     Strata 1: <one>
         SU 1: univcode
        FPC 1: <zero>

. svy: mean z_cs
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =       1        Number of obs   =      8,440
Number of PSUs   =     312        Population size = 47,387.941
                                  Design df       =        311

--------------------------------------------------------------
             |             Linearized
             |       Mean   Std. Err.     [95% Conf. Interval]
-------------+------------------------------------------------
        z_cs |  -.4965261   .0598833     -.6143537   -.3786985
--------------------------------------------------------------

. svy: mean z_cs if country == "USA"
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =       1        Number of obs   =      6,847
Number of PSUs   =     231        Population size =      6,847
                                  Design df       =        230

--------------------------------------------------------------
             |             Linearized
             |       Mean   Std. Err.     [95% Conf. Interval]
-------------+------------------------------------------------
        z_cs |   .1568868   .0524319      .0535785    .2601951
--------------------------------------------------------------

. svy: mean z_cs if country == "India"
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =       1        Number of obs   =        364
Number of PSUs   =      15        Population size =        364
                                  Design df       =         14

--------------------------------------------------------------
             |             Linearized
             |       Mean   Std. Err.     [95% Conf. Interval]
-------------+------------------------------------------------
        z_cs |  -.7275792   .1416768     -1.031446   -.4237127
--------------------------------------------------------------

. svy: mean z_cs if country == "China"
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =       1        Number of obs   =        678
Number of PSUs   =      32        Population size = 28,445.499
                                  Design df       =         31

--------------------------------------------------------------
             |             Linearized
             |       Mean   Std. Err.     [95% Conf. Interval]
-------------+------------------------------------------------
        z_cs |  -.6016914   .0859474     -.7769822   -.4264006
--------------------------------------------------------------

. svy: mean z_cs if country == "Russia"
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =       1        Number of obs   =        551
Number of PSUs   =      34        Population size = 11,731.442
                                  Design df       =         33

--------------------------------------------------------------
             |             Linearized
             |       Mean   Std. Err.     [95% Conf. Interval]
-------------+------------------------------------------------
        z_cs |  -.6157216   .1005255     -.8202422   -.4112009


. tab z_cs

       z_cs |      Freq.     Percent        Cum.
------------+-----------------------------------
   -1.30849 |        794        9.41        9.41
   -1.16552 |        463        5.49       14.89
  -1.022551 |        326        3.86       18.76
  -.8795821 |        334        3.96       22.71
   -.736613 |        404        4.79       27.50
  -.5936438 |        645        7.64       35.14
  -.4506747 |        337        3.99       39.14
  -.3077055 |        569        6.74       45.88
  -.1647364 |        345        4.09       49.96
  -.0217672 |        573        6.79       56.75
   .1212019 |        566        6.71       63.46
   .2641711 |        293        3.47       66.93
   .4071402 |        470        5.57       72.50
   .5501094 |        264        3.13       75.63
   .6930785 |        445        5.27       80.90
   .8360476 |        203        2.41       83.31
   .9790168 |        325        3.85       87.16
   1.121986 |        153        1.81       88.97
   1.264955 |        128        1.52       90.49
   1.407924 |        114        1.35       91.84
   1.550893 |        208        2.46       94.30
   1.693863 |         72        0.85       95.15
   1.836832 |         71        0.84       96.00
   1.979801 |         64        0.76       96.75
    2.12277 |         51        0.60       97.36
   2.265739 |          3        0.04       97.39
   2.408708 |         37        0.44       97.83
   2.551677 |         33        0.39       98.22
   2.694647 |         26        0.31       98.53
   2.837616 |         32        0.38       98.91
   3.123554 |         21        0.25       99.16
   3.266523 |          3        0.04       99.19
   3.409492 |         17        0.20       99.40
   3.552461 |         12        0.14       99.54
     3.8384 |         10        0.12       99.66
   4.267307 |         11        0.13       99.79
   4.553246 |          8        0.09       99.88
   4.696215 |          1        0.01       99.89
   5.125122 |          1        0.01       99.91
   5.696999 |          4        0.05       99.95
   6.411844 |          1        0.01       99.96
   7.269659 |          3        0.04      100.00
------------+-----------------------------------
      Total |      8,440      100.00

. tab z_cs if country=="USA"

       z_cs |      Freq.     Percent        Cum.
------------+-----------------------------------
   -1.30849 |        356        5.20        5.20
   -1.16552 |        297        4.34        9.54
  -1.022551 |        183        2.67       12.21
  -.8795821 |        236        3.45       15.66
   -.736613 |        242        3.53       19.19
  -.5936438 |        527        7.70       26.89
  -.4506747 |        231        3.37       30.26
  -.3077055 |        524        7.65       37.91
  -.1647364 |        282        4.12       42.03
  -.0217672 |        542        7.92       49.95
   .1212019 |        521        7.61       57.56
   .2641711 |        264        3.86       61.41
   .4071402 |        444        6.48       67.90
   .5501094 |        240        3.51       71.40
   .6930785 |        423        6.18       77.58
   .8360476 |        185        2.70       80.28
   .9790168 |        318        4.64       84.93
   1.121986 |        147        2.15       87.07
   1.264955 |        120        1.75       88.83
   1.407924 |        112        1.64       90.46
   1.550893 |        205        2.99       93.46
   1.693863 |         69        1.01       94.46
   1.836832 |         68        0.99       95.46
   1.979801 |         59        0.86       96.32
    2.12277 |         49        0.72       97.04
   2.408708 |         37        0.54       97.58
   2.551677 |         32        0.47       98.04
   2.694647 |         22        0.32       98.36
   2.837616 |         31        0.45       98.82
   3.123554 |         19        0.28       99.09
   3.409492 |         16        0.23       99.33
   3.552461 |         10        0.15       99.47
     3.8384 |          9        0.13       99.61
   4.267307 |         11        0.16       99.77
   4.553246 |          8        0.12       99.88
   5.125122 |          1        0.01       99.90
   5.696999 |          3        0.04       99.94
   6.411844 |          1        0.01       99.96
   7.269659 |          3        0.04      100.00
------------+-----------------------------------
      Total |      6,847      100.00

. tab z_cs if country=="India"

       z_cs |      Freq.     Percent        Cum.
------------+-----------------------------------
   -1.30849 |        140       38.46       38.46
   -1.16552 |         32        8.79       47.25
  -1.022551 |         17        4.67       51.92
  -.8795821 |         20        5.49       57.42
   -.736613 |         46       12.64       70.05
  -.5936438 |         16        4.40       74.45
  -.4506747 |          8        2.20       76.65
  -.3077055 |         21        5.77       82.42
  -.1647364 |          9        2.47       84.89
  -.0217672 |          8        2.20       87.09
   .1212019 |          2        0.55       87.64
   .2641711 |          8        2.20       89.84
   .4071402 |          2        0.55       90.38
   .5501094 |          8        2.20       92.58
   .6930785 |          5        1.37       93.96
   .8360476 |          6        1.65       95.60
   .9790168 |          2        0.55       96.15
   1.121986 |          1        0.27       96.43
   1.264955 |          3        0.82       97.25
   1.550893 |          2        0.55       97.80
   1.979801 |          2        0.55       98.35
    2.12277 |          1        0.27       98.63
   2.265739 |          1        0.27       98.90
   2.551677 |          1        0.27       99.18
   2.694647 |          2        0.55       99.73
   3.409492 |          1        0.27      100.00
------------+-----------------------------------
      Total |        364      100.00

. tab z_cs if country=="China"

       z_cs |      Freq.     Percent        Cum.
------------+-----------------------------------
   -1.30849 |        149       21.98       21.98
   -1.16552 |         96       14.16       36.14
  -1.022551 |         40        5.90       42.04
  -.8795821 |         40        5.90       47.94
   -.736613 |         78       11.50       59.44
  -.5936438 |         41        6.05       65.49
  -.4506747 |         54        7.96       73.45
  -.3077055 |         15        2.21       75.66
  -.1647364 |         33        4.87       80.53
  -.0217672 |         16        2.36       82.89
   .1212019 |         26        3.83       86.73
   .2641711 |         14        2.06       88.79
   .4071402 |         19        2.80       91.59
   .5501094 |          9        1.33       92.92
   .6930785 |         13        1.92       94.84
   .8360476 |          6        0.88       95.72
   .9790168 |          3        0.44       96.17
   1.121986 |          3        0.44       96.61
   1.264955 |          1        0.15       96.76
   1.407924 |          1        0.15       96.90
   1.693863 |          3        0.44       97.35
   1.836832 |          2        0.29       97.64
   1.979801 |          2        0.29       97.94
    2.12277 |          1        0.15       98.08
   2.265739 |          2        0.29       98.38
   2.694647 |          1        0.15       98.53
   2.837616 |          1        0.15       98.67
   3.123554 |          2        0.29       98.97
   3.266523 |          2        0.29       99.26
   3.552461 |          2        0.29       99.56
     3.8384 |          1        0.15       99.71
   4.696215 |          1        0.15       99.85
   5.696999 |          1        0.15      100.00
------------+-----------------------------------
      Total |        678      100.00

. tab z_cs if country=="Russia"

       z_cs |      Freq.     Percent        Cum.
------------+-----------------------------------
   -1.30849 |        149       27.04       27.04
   -1.16552 |         38        6.90       33.94
  -1.022551 |         86       15.61       49.55
  -.8795821 |         38        6.90       56.44
   -.736613 |         38        6.90       63.34
  -.5936438 |         61       11.07       74.41
  -.4506747 |         44        7.99       82.40
  -.3077055 |          9        1.63       84.03
  -.1647364 |         21        3.81       87.84
  -.0217672 |          7        1.27       89.11
   .1212019 |         17        3.09       92.20
   .2641711 |          7        1.27       93.47
   .4071402 |          5        0.91       94.37
   .5501094 |          7        1.27       95.64
   .6930785 |          4        0.73       96.37
   .8360476 |          6        1.09       97.46
   .9790168 |          2        0.36       97.82
   1.121986 |          2        0.36       98.19
   1.264955 |          4        0.73       98.91
   1.407924 |          1        0.18       99.09
   1.550893 |          1        0.18       99.27
   1.836832 |          1        0.18       99.46
   1.979801 |          1        0.18       99.64
   2.694647 |          1        0.18       99.82
   3.266523 |          1        0.18      100.00
------------+-----------------------------------
      Total |        551      100.00

. sum z_cs, detail

                            z_cs
-------------------------------------------------------------
      Percentiles      Smallest
 1%     -1.30849       -1.30849
 5%     -1.30849       -1.30849
10%     -1.16552       -1.30849       Obs               8,440
25%     -.736613       -1.30849       Sum of Wgt.       8,440

50%    -.0217672                      Mean          -4.06e-09
                        Largest       Std. Dev.             1
75%     .5501094       6.411844
90%     1.264955       7.269659       Variance              1
95%     1.693863       7.269659       Skewness       1.117526
99%     3.123554       7.269659       Kurtosis       5.637665

. sum z_cs if country=="USA", detail

                            z_cs
-------------------------------------------------------------
      Percentiles      Smallest
 1%     -1.30849       -1.30849
 5%     -1.30849       -1.30849
10%    -1.022551       -1.30849       Obs               6,847
25%    -.5936438       -1.30849       Sum of Wgt.       6,847

50%     .1212019                      Mean           .1568868
                        Largest       Std. Dev.      .9798644
75%     .6930785       6.411844
90%     1.407924       7.269659       Variance       .9601343
95%     1.836832       7.269659       Skewness       1.074296
99%     3.123554       7.269659       Kurtosis       5.861535

.  sum z_cs if country=="India", detail

                            z_cs
-------------------------------------------------------------
      Percentiles      Smallest
 1%     -1.30849       -1.30849
 5%     -1.30849       -1.30849
10%     -1.30849       -1.30849       Obs                 364
25%     -1.30849       -1.30849       Sum of Wgt.         364

50%    -1.022551                      Mean          -.7275792
                        Largest       Std. Dev.      .7978043
75%    -.4506747       2.551677
90%     .4071402       2.694647       Variance       .6364917
95%     .8360476       2.694647       Skewness       2.069825
99%     2.551677       3.409492       Kurtosis       8.025611

.  sum z_cs if country=="China", detail

                            z_cs
-------------------------------------------------------------
      Percentiles      Smallest
 1%     -1.30849       -1.30849
 5%     -1.30849       -1.30849
10%     -1.30849       -1.30849       Obs                 678
25%     -1.16552       -1.30849       Sum of Wgt.         678

50%     -.736613                      Mean           -.586896
                        Largest       Std. Dev.      .8690828
75%    -.3077055       3.552461
90%     .4071402         3.8384       Variance        .755305
95%     .8360476       4.696215       Skewness       2.572058
99%     3.266523       5.696999       Kurtosis       13.06825

.  sum z_cs if country=="Russia", detail

                            z_cs
-------------------------------------------------------------
      Percentiles      Smallest
 1%     -1.30849       -1.30849
 5%     -1.30849       -1.30849
10%     -1.30849       -1.30849       Obs                 551
25%     -1.30849       -1.30849       Sum of Wgt.         551

50%    -.8795821                      Mean          -.7467324
                        Largest       Std. Dev.      .6346589
75%    -.4506747       1.836832
90%     .1212019       1.979801       Variance       .4027919
95%     .5501094       2.694647       Skewness       1.963328
99%     1.407924       3.266523       Kurtosis       8.741116

. log off
      name:  Ziqi
       log:  W:\Ziqi\Study\BUPT\3rd Year\NCM\CS Test\Data\CS_test.log
  log type:  text
 paused on:  11 Jun 2019, 20:07:06
----------------------------------------------------------------
